
*** A Simple Example:
How does the following code work?

#+BEGIN_SRC js :results output
  setTimeout(function(){
    console.log("callback!");
  }, 1000);
#+END_SRC

#+RESULTS:
: callback!

First, a event is scheduled to be fired after 1000ms. Sometime after this countdown has finished, depending largely on what else is going on within the event loop, the event will fire, causing the function to execute.

*** Thunk Ex:
A thunk is a function that requires no new arguments to execute and return a value.

#+BEGIN_SRC js :results output
  function add (x, y) {
    return x + y;
  }
  const thunk = () => add(10,15);
  console.log(thunk());
#+END_SRC

#+RESULTS:
: 25

Thunks are the concetual underpinning for promises: a wrapper around a value.

*** Async Thunk Ex:
What is an async thunk? a function that needs to be passed a callback so you can 
access a value.
  Note that both the thunk and reference function's signature and body handle 
the asynchronicity. But, once the asynchronous code is embedded in the thunk, we can access the value in the thunk without concerning ourselves with the temporal 
implementation.

#+BEGIN_SRC js :results output
  function addAsync(x, y, cb) {
    setTimeout(function() {
      cb(x+y);
    }, 1000);
  }

  let thunk = function(cb) {
    addAsync(10,15,cb);
  };

  thunk((x) => console.log(x));  
#+END_SRC

#+RESULTS:
: 25

*** Thunk Maker & Nesting Thunks Ex:

#+BEGIN_SRC js :results output
  function makeThunk(fn, ...args){
    return function(cb) {
      args.push(cb);
      fn.apply(null, args);
    };
  }

  function getData(n, cb){
    cb(n);
  }

  let get10 = makeThunk(getData, 10);
  let get30 = makeThunk(getData, 30);
  
  get10(function(n1){
    let x = 1 + n1;
    get30(function(n2){
      let y = 1 + n2;
      let getAnswer = makeThunk(getData, (x + y));
      getAnswer((x) => console.log(x));
    });
  });
#+END_SRC

#+RESULTS:
: 42

**** dot chaining Example:
#+BEGIN_SRC js :results output
  function getData(d) {
    return new Promise(function(resolve, reject){
      setTimeout(function(){ 
        resolve(d); 
      }, 1000);
    });
  }

  let x;

  getData(10)
  .then(function(num1){
    x = 1 + num1;
    return getData(30);
  })
  .then(function(num2){
    let y = 1 + num2;
    return getData("Meaning of Life: " + ( x + y));
  })
  .then(function(answer){
    console.log(answer);
  })
#+END_SRC

#+RESULTS:
: Meaning of Life: 42

*** Exercise #3

 #+BEGIN_SRC js :results output
function fakeAjax(url,cb) {
	var fake_responses = {
		"file1": "The first text",
		"file2": "The middle text",
		"file3": "The last text"
	};

	var randomDelay = (Math.round(Math.random() * 1E4) % 8000) + 1000;

	console.log("Requesting: " + url);

	setTimeout(function(){
		cb(fake_responses[url]);
	},randomDelay);
}

function output(text) {
	console.log(text);
}

// **************************************

function getFile(file) {
    return new Promise(function(resolve, reject){
      fakeAjax(file, resolve); 
    });
}

// request all files at once in "parallel"

let file1 = getFile("file1");
let file2 = getFile("file2");
let file3 = getFile("file3");

// print results in the correct order

file1
.then(output)
.then(function(data){
  console.log("Data: ", data); // note we're not dealing with file1 anymore
  return file2;
})
.then(function(data){
  output(data);
  return file3;
})
.then(function(data){
  output(data);
})

#+END_SRC

 #+RESULTS:
 : Requesting: file1
 : Requesting: file2
 : Requesting: file3
 : The first text
 : Data:  undefined
 : The middle text
 : The last text

*** Exercise #4 (using map/reduce)

#+BEGIN_SRC js :results output

function fakeAjax(url,cb) {
	var fake_responses = {
		"file1": "The first text",
		"file2": "The middle text",
		"file3": "The last text"
	};
	var randomDelay = (Math.round(Math.random() * 1E4) % 8000) + 1000;

	console.log("Requesting: " + url);

	setTimeout(function(){
		cb(fake_responses[url]);
	},randomDelay);
}

function output(text) {
	console.log(text);
}

function getFile(file) {
	return new Promise(function(resolve){
		fakeAjax(file,resolve);
	});
}

// **************************************

// Render as each one finishes,
// but only once previous rendering
// is done.

// Represent our ajax request targets as a list
let URLs = ["file1", "file2", "file3"];
// Map the urls to create a list of promise objects
let promises = URLs.map(getFile);
// Reduce the list of promises, starting with a pre-resolved promise, and .chaining
let answers = promises.reduce(function combine(chain, pr) {
                                return chain.then(function() {
                                  return pr 
                                }).then(output);
                              }, Promise.resolve());

// Note this happens first! The callback passed to the promises in the reduce, execute
// upon the promises completion event firing, causing the chain reaction
answers.then(output("Complete!"));

#+END_SRC

#+RESULTS:
: Requesting: file1
: Requesting: file2
: Requesting: file3
: Complete!
: The first text
: The middle text
: The last text

**** promise.race (first to succeed/fail)
Promise.race also accepts an array of promises, but only calls the .then method with the first promise that completes, regardless of its outcome. Any remaining promises are thrown away to be garbage collected.

#+BEGIN_SRC js :results output

var p = new Promise(function(resolve, reject){
    setTimeout(function(){
      resolve("The Data!");
    }, 2000);
  });

function success(d){
  console.log("Success:", d);
}

function error(e){
  console.log("Failure: ", e);
}

Promise.race([
  p,
  new Promise(function(resolve, reject){
    setTimeout(function(){
      reject("Timeout!");
    }, 3000);
  })
]).then(success, error);



#+END_SRC

#+RESULTS:
: Success:The Data!

**** Getting Values Out:

#+BEGIN_SRC js
function *gen() {
  yield 1;
  yield 2;
  yield 3;
  //return 4;
}

var it = gen();

console.log(it.next());
console.log(it.next());
console.log(it.next());
console.log(it.next());

#+END_SRC

#+RESULTS:
: { value: 1, done: false }
: { value: 2, done: false }
: { value: 3, done: false }
: { value: undefined, done: true }
: undefined

**** Putting Values In
When you call .next on an iterator, you can pass a value into the generator function to replace the yield expression where the generator function paused. Note, this means that the first .next call of the iterator - which starts the generator function - cannot pass a value into the generator. 

#+BEGIN_SRC js :results output
function coroutine(g){
  var it = g();
  return function(){
    return it.next.apply(it, arguments);
  };
}

var run = coroutine(function*(){
  var x = 1 + (yield);
  var y = 1 + (yield);
  // on the third yield, the generator yields a value (x + y)
  // accessible via the iterator's .value property
  yield (x + y); 
});

run();
run(10); // 10 replaces the first yield keyword
console.log('Meaning of Life: ' + run(30).value); // 30 replaces the second yield keyword

#+END_SRC

#+RESULTS:
: Meaning of Life: 42

*** Async Generators
Here's where the rubber meets the use case. We're able to write synchronous looking code, that abstracts away asynchronous execution, by passing the means to resume execution to the async process, to trigger upon 'completion.'

#+BEGIN_SRC js :results output
function coroutine(g){
  var it = g();
  return function(){
    return it.next.apply(it, arguments);
  };
}

var run = coroutine(function*(){
  var x = 1 + (yield getData(10));
  var y = 1 + (yield getData(30));
  var answer = (yield getData("Meaning of Life: " + (x + y)));
  console.log(answer);
});

function getData(d){
  setTimeout(function(){ run(d)}, 1000);
}

run();
#+END_SRC

#+RESULTS:
: Meaning of Life: 42

